GitMasterNikanjam/Serial_STM32/src/Serial.h
	private:
		
		/// @brief HAL UART handle used for all low-level operations (not owned).
		UART_HandleTypeDef *_huart;

		/**
		 * @brief Internal Stream instance managing TX/RX buffers.
		 * @note Stream provides the buffer types (linear/ring) and push/pop helpers.
		 */
		Stream stream;

		/// @brief Single-byte staging buffer used with HAL_UART_Receive_IT().
		char _rxBuffer;

		/// @brief Number of bytes currently being transmitted by HAL (interrupt TX).
		volatile uint16_t _txBufferSize2Transmitting;

		/// @brief Timeout used for blocking operations and helper methods (ms).
		unsigned long _timeout;

		/// @brief UART baud rate last passed to begin().
		unsigned long _baudRate;

		/// @brief Current TX mode (one of ::PROGRAM_MODE_*).
		volatile uint8_t _txMode;

		/// @brief Current RX mode (one of ::PROGRAM_MODE_*).
		volatile uint8_t _rxMode;

		/// @brief Indicates whether a transmit operation is considered active.
		volatile bool _isTransmitting;

		/// @brief Indicates whether reception via interrupt has been started.
		volatile bool _isReceiving;

		/**
		 * @brief Start an interrupt-driven TX if the UART is idle.
		 * @return true if a transfer was started or the UART is busy; false on error.
		 */
		bool _startTxIfIdle(void);

		/**
		 * @brief Enable UART interrupt in NVIC (currently a stub).
		 *
		 * NVIC configuration is highly application-specific (IRQ number and priority),
		 * therefore this function is intentionally left as a placeholder.
		 */
		void _EnableIRQ(void);

		/**
		 * @brief Try to kick off (or continue) an interrupt-driven TX transfer.
		 *
		 * If the UART is idle and there is queued TX data, this will start a HAL_UART_Transmit_IT()
		 * for the next contiguous chunk in the TX buffer.
		 *
		 * @return true on success (or if nothing needs to be done), false on failure.
		 */
		bool kickTx();
};






